; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=5, packages=10, locations=12, density=0.24242424242424243, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=22, seed=63

(define (problem transport-22)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l11)
    (at p2 l2)
    (at p3 l7)
    (at p4 l12)
    (at p5 l2)
    (at p6 l2)
    (at p7 l11)
    (at p8 l4)
    (at p9 l5)
    (at p10 l2)
    (at v1 l11)
    (at v2 l5)
    (at v3 l12)
    (at v4 l10)
    (at v5 l1)
    (road l5 l9)
    (road l2 l8)
    (road l9 l8)
    (road l11 l2)
    (road l8 l9)
    (road l8 l6)
    (road l3 l2)
    (road l5 l4)
    (road l8 l2)
    (road l7 l1)
    (road l4 l5)
    (road l2 l3)
    (road l8 l7)
    (road l10 l5)
    (road l5 l10)
    (road l6 l8)
    (road l8 l12)
    (road l2 l11)
    (road l1 l7)
    (road l9 l5)
    (road l7 l8)
    (road l12 l8)
    (road l1 l11)
    (road l11 l1)
    (road l9 l12)
    (road l12 l9)
    (road l3 l6)
    (road l6 l3)
    (road l3 l7)
    (road l7 l3)
    (road l7 l10)
    (road l10 l7)
    )
 (:goal  (and 
    (at p1 l3)
    (at p2 l7)
    (at p3 l5)
    (at p4 l9)
    (at p5 l9)
    (at p6 l9)
    (at p7 l5)
    (at p8 l2)
    (at p9 l10)
    (at p10 l8))))

; plan
1. (pick-up v3 l12 p4 c1 c2)
   deleted: (at p4 l12) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 0 of 10
2. (drive v3 l12 l8)
   deleted: (at v3 l12)
   added: (at v3 l8)
   goals met: 0 of 10
3. (drive v3 l8 l9)
   deleted: (at v3 l8)
   added: (at v3 l9)
   goals met: 0 of 10
4. (drop v3 l9 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l9) (capacity v3 c2)
   goals met: 1 of 10
5. (drive v1 l11 l2)
   deleted: (at v1 l11)
   added: (at v1 l2)
   goals met: 1 of 10
6. (pick-up v1 l2 p10 c1 c2)
   deleted: (at p10 l2) (capacity v1 c2)
   added: (in p10 v1) (capacity v1 c1)
   goals met: 1 of 10
7. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 1 of 10
8. (drop v1 l8 p10 c1 c2)
   deleted: (in p10 v1) (capacity v1 c1)
   added: (at p10 l8) (capacity v1 c2)
   goals met: 2 of 10
9. (pick-up v2 l5 p9 c1 c2)
   deleted: (at p9 l5) (capacity v2 c2)
   added: (in p9 v2) (capacity v2 c1)
   goals met: 2 of 10
10. (drive v2 l5 l10)
   deleted: (at v2 l5)
   added: (at v2 l10)
   goals met: 2 of 10
11. (drop v2 l10 p9 c1 c2)
   deleted: (in p9 v2) (capacity v2 c1)
   added: (at p9 l10) (capacity v2 c2)
   goals met: 3 of 10
12. (drive v5 l1 l11)
   deleted: (at v5 l1)
   added: (at v5 l11)
   goals met: 3 of 10
13. (pick-up v1 l8 p10 c1 c2)
   deleted: (at p10 l8) (capacity v1 c2)
   added: (in p10 v1) (capacity v1 c1)
   goals met: 2 of 10
14. (pick-up v5 l11 p1 c1 c2)
   deleted: (at p1 l11) (capacity v5 c2)
   added: (in p1 v5) (capacity v5 c1)
   goals met: 2 of 10
15. (drive v5 l11 l2)
   deleted: (at v5 l11)
   added: (at v5 l2)
   goals met: 2 of 10
16. (drive v5 l2 l3)
   deleted: (at v5 l2)
   added: (at v5 l3)
   goals met: 2 of 10
17. (drop v5 l3 p1 c1 c2)
   deleted: (in p1 v5) (capacity v5 c1)
   added: (at p1 l3) (capacity v5 c2)
   goals met: 3 of 10
18. (drop v1 l8 p10 c1 c2)
   deleted: (in p10 v1) (capacity v1 c1)
   added: (at p10 l8) (capacity v1 c2)
   goals met: 4 of 10
19. (drive v3 l9 l5)
   deleted: (at v3 l9)
   added: (at v3 l5)
   goals met: 4 of 10
20. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 4 of 10
21. (pick-up v1 l2 p2 c1 c2)
   deleted: (at p2 l2) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 4 of 10
22. (drive v2 l10 l7)
   deleted: (at v2 l10)
   added: (at v2 l7)
   goals met: 4 of 10
23. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 4 of 10
24. (drive v1 l8 l7)
   deleted: (at v1 l8)
   added: (at v1 l7)
   goals met: 4 of 10
25. (drop v1 l7 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l7) (capacity v1 c2)
   goals met: 5 of 10
26. (drive v5 l3 l2)
   deleted: (at v5 l3)
   added: (at v5 l2)
   goals met: 5 of 10
27. (pick-up v5 l2 p5 c1 c2)
   deleted: (at p5 l2) (capacity v5 c2)
   added: (in p5 v5) (capacity v5 c1)
   goals met: 5 of 10
28. (pick-up v1 l7 p3 c1 c2)
   deleted: (at p3 l7) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 5 of 10
29. (pick-up v5 l2 p6 c0 c1)
   deleted: (at p6 l2) (capacity v5 c1)
   added: (in p6 v5) (capacity v5 c0)
   goals met: 5 of 10
30. (drive v5 l2 l8)
   deleted: (at v5 l2)
   added: (at v5 l8)
   goals met: 5 of 10
31. (drive v5 l8 l9)
   deleted: (at v5 l8)
   added: (at v5 l9)
   goals met: 5 of 10
32. (drop v5 l9 p5 c0 c1)
   deleted: (in p5 v5) (capacity v5 c0)
   added: (at p5 l9) (capacity v5 c1)
   goals met: 6 of 10
33. (drop v5 l9 p6 c1 c2)
   deleted: (in p6 v5) (capacity v5 c1)
   added: (at p6 l9) (capacity v5 c2)
   goals met: 7 of 10
34. (drive v5 l9 l5)
   deleted: (at v5 l9)
   added: (at v5 l5)
   goals met: 7 of 10
35. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 7 of 10
36. (drive v1 l8 l9)
   deleted: (at v1 l8)
   added: (at v1 l9)
   goals met: 7 of 10
37. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 7 of 10
38. (drop v1 l5 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l5) (capacity v1 c2)
   goals met: 8 of 10
39. (drive v5 l5 l4)
   deleted: (at v5 l5)
   added: (at v5 l4)
   goals met: 8 of 10
40. (drive v3 l5 l4)
   deleted: (at v3 l5)
   added: (at v3 l4)
   goals met: 8 of 10
41. (drive v1 l5 l4)
   deleted: (at v1 l5)
   added: (at v1 l4)
   goals met: 8 of 10
42. (pick-up v1 l4 p8 c1 c2)
   deleted: (at p8 l4) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 8 of 10
43. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 8 of 10
44. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 8 of 10
45. (drive v1 l9 l8)
   deleted: (at v1 l9)
   added: (at v1 l8)
   goals met: 8 of 10
46. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 8 of 10
47. (drive v1 l2 l11)
   deleted: (at v1 l2)
   added: (at v1 l11)
   goals met: 8 of 10
48. (pick-up v1 l11 p7 c0 c1)
   deleted: (at p7 l11) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 8 of 10
49. (drive v1 l11 l2)
   deleted: (at v1 l11)
   added: (at v1 l2)
   goals met: 8 of 10
50. (drop v1 l2 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l2) (capacity v1 c1)
   goals met: 9 of 10
51. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 9 of 10
52. (drive v1 l8 l9)
   deleted: (at v1 l8)
   added: (at v1 l9)
   goals met: 9 of 10
53. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 9 of 10
54. (drop v1 l5 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l5) (capacity v1 c2)
   goals met: 10 of 10
